Repository: MX-Linux/mx-rofi-manager
Catalog: translations_script/po/mx-rofi-manager_*.po
Languages: nb

source: TERMS - LOCATION: The general placement of the rofi window on the screen - ANCHOR: The point of the rofi window which is set at the location. - X-OFFSET & Y-OFFSET: The offset (pixels) of the rofi window from the anchor point EXAMPLES Location center, anchor center: places the center of the rofi window at the center of the screen Location northwest, anchor northwest: places the top left corner of the rofi window at the top left of the screen. Location center, anchor northwest: places the top left corner of the rofi window at the center of the screen. Location west, anchor west, x-offset 32: displaces the rofi window to avoid overlap with a vertical panel.
nb: LEDD -LOCATION: Den generelle plasseringen av rofi-vinduet på skjermen -ANCHOR: Punktet i rofi-vinduet som plasseres i posisjonen. - X-OFFSET og Y-OFFSET: Forskyvning i piksler av rofi-vinduet fra ankerpunktet EKSEMPLER Plassering «center», anker «center»: Plasserer midten av rofi-vinduet midt på skjermen Plassering «northwest», anker «northwest»: Plasserer øvre venstre hjørne av rofi-vinduet i øvre venstre del av skjermen Plassering «center», anker «northwest»: Plasserer øvre venstre hjørne av rofi-vinduet midt på skjermen Plassering «west», anker «west», «x-offset 32»: Plasserer rofi-vinduet slik at det ikke overlapper med et loddrett panel

source: X-Offset (- to left, + to right)
nb: X-forskyvning (- til venstre, + til høyre)

source: Y-Offset (- upwards, + downwards)
nb: Y-forskyvning (- oppover, + nedover)

source: 1st Tab
nb: 1. fane

source: 2nd Tab
nb: 2. fane

source: 3rd Tab
nb: 3. fane

source: <b>Adjust the font of the current rofi window.</b>
nb: <b>Justere skrifttypen i gjeldende rofi-vindu.</b>

source: <b>Make new theme current?</b>
nb: <b>Ta i bruk det nye temasettet?</b>

source: <b>Name for new style</b>
nb: <b>Den nye stilens navn</b>

source: <b>Name for new theme</b>
nb: <b>Det nye temasettets navn</b>

source: <b>Name for new theme</b>
nb: <b>Det nye temasettets navn</b>

source: <b>Rofi Manager is a tool to configure rofi themes.\n\n<i>What would you like to do?</i></b>\n
nb: <b>Verktøyet Rofi Manager setter opp rofi-temasett.\n\n<i>Hva vil du gjøre?</i></b>\n

source: <b>\nAdjust the location and size of the current rofi window.\n</b>
nb: <b>\nJustere posisjonen og størrelsen til gjeldende rofi-vindu.\n</b>

source: <b>\nEdit colors and create a new rofi theme.\n\n</b>
nb: <b>\nRediger farger og lag et nytt rofi-temasett.\n\n</b>

source: A Theme with this name already exists. \n\nDo you want to overwrite <b>$NEWNAME</b>\nor save as a different theme name?\n
nb: Det finnes allerede et temasett som heter dette. \n\nVil du overskrive $NEWNAME <b>\n eller lagre det med et nytt navn?\n

source: Active Tab Background
nb: Bakgrunn for aktiv fane

source: Active Tab Highlight
nb: Utheving av aktiv fane

source: Active Tab Text
nb: Tekst i aktiv fane

source: All done!\n<b>$NEWNAME</b> Rofi theme has been created.\n\nYou can change themes with <b>MX-Rofi-Manager</b>
nb: Fullført.\nRofi-temasettet <b>$NEWNAME</b> er nå opprettet.\n\nVerktøyet MX-Rofi-Manager kan endre temasett<b>

source: All done!\n<b>$NEWNAME</b> has been set as the current rofi theme.
nb: Fullført.\n<b>$NEWNAME</b> er nå valgt som gjeldende rofi-temasett.

source: All done!\nFont of the current rofi theme has been amended.
nb: Ferdig.\nSkrifttypen til gjeldende rofi-temasett er endret.

source: All done!\nPosition and size of the current rofi theme have been amended.
nb: Ferdig.\nPosisjonen og størrelsen til gjeldende rofi-temasett er endret.

source: All done!\n\n<b>$NEWTHEME</b> has been set as the current rofi theme.\n\n
nb: Fullført.\n\n<b>$NEWTHEME</b> er nå valgt som gjeldende rofi-temasett.\n\n

source: All done!\n\nTab configuration has been updated.\n\n
nb: Fullført.\n\nOppsett av faner er nå oppdatert.\n\n

source: Change the current rofi theme
nb: Endre gjeldende rofi-temasett

source: Change the font of the current Rofi window
nb: Endre skrifttypen i gjeldende Rofi-vindu

source: Change the functions (<i> modi </i>) of the rofi tabs
nb: Endre funksjonene (<i>modi</i>) til rofi-fanene

source: Change the location and size of the current Rofi window
nb: Justere posisjon og størrelse til gjeldende Rofi-vindu

source: Edit a rofi theme config file in text editor
nb: Rediger oppsett av rofi-temasett i et tekstredigeringsprogram

source: Font
nb: Skrifttype

source: Global settings are blocked for
nb: Globale innstillinger er blokkert for

source: Height (number of lines shown in list)
nb: Høyde (antall linjer som skal vises i lista)

source: If a theme does not display tabs, switch tabs with <i>Shift + Arrow</i> or <i>Ctrl + Tab</i>\n
nb: Bytt faner med <i>Shift + piltast</i> eller <i>Ctrl + Tab</i> hvis et temasett ikke viser faner\n

source: Inactive Tab Background
nb: Bakgrunn for inaktiv fane

source: Inactive Tab Text
nb: Tekst i inaktiv fane

source: Location of rofi window on the screen
nb: Rofi-vinduets posisjon på skjermen

source: MX Rofi manager provides a fast and easy way to manipulate the handy app rofi and its many possible functions ("modi"). Available actions: --select the functions to be shown --switch the current theme --adjust colors, font and position (default themes only) --edit themes manually --access documentation For more details, consult the rofi "help" tab.
nb: MX Rofi Manager tilbyr en rask og enkel måte å behandle rofi-programmet og dets funksjonalitet (moduser). Tilgjengelige handlinger: – velg funksjoner som skal vises – bytt gjeldende tema – juster farger, skrifter og posisjon (kun forvalgte tema) – manuell redigering av tema – tilgang til hjelpetekst Se fanen «Hjelp» for flere detaljer.

source: MX-Rofi-Recolor Help
nb: Hjelpetekst for MX-Rofi-Recolor

source: New theme name
nb: Det nye temasettets navn

source: No Theme name!
nb: Mangler navn for temasett

source: No change to current settings!\n
nb: Ingen endring av gjeldende innstillinger.\n

source: No theme selected.
nb: Ingen temasett valgt.

source: No theme selected.\n\n<b>MX-comfort</b> will be used as the starting theme.
nb: Ingen temasett valgt.\n\n<b>MX-comfort</b> vil tas i bruk som temasett.

source: OK to proceed?
nb: Vil du fortsette?

source: Overwrite $NEWNAME
nb: Overskriv $NEWNAME

source: Recolor a rofi theme based on MX-comfort
nb: Fargelegg et rofi-temasett basert på MX-comfort

source: Return to Main Window
nb: Gå tilbake til hovedvinduet

source: Save as different theme name
nb: Lagre temasett med annet navn

source: Searchbar Background
nb: Søkbar bakgrunn

source: Searchbar Text
nb: Søkbar tekst

source: Selection Background
nb: Bakgrunn for utvalg

source: Selection Text
nb: Utvalgt tekst

source: Settings
nb: Innstillinger

source: Sorry, the appearance settings for $ROFICURRENT can only be modified using global settings.\n\nWould you like to change to global settings?.\n\n
nb: Beklager, men oppsett av utseende for $ROFICURRENT kan kun endres med globale innstillinger.\n\nVil du bytte til globale innstillinger nå?\n\n

source: Specific settings will be used
nb: Spesifikke innstillinger vil brukes

source: The current appearance settings are <b>$TOGGLETEXT</b>\n
nb: Gjeldende innstilling av utseende er <b>$TOGGLETEXT</b>\n

source: The current theme is <b>$ROFICURRENT</b> and its settings are <b>$TOGGLETEXT</b>.
nb: Gjeldende tema er <b>$ROFICURRENT</b> og innstillingene er <b>$TOGGLETEXT</b>.

source: Theme name $NEWNAME is protected. Choose another name
nb: Temasett-navnet $NEWNAME er beskyttet. Velg et annet navn

source: This tool edits the rofi config file.\n\nThe existing file will be backed up as \n\n<b>$HOME/.restore/rofi/config.rasi_$NOW</b>
nb: Dette verktøyet redigerer oppsettsfil for rofi.\n\nEksisterende fil vil reservekopieres til \n\n$HOME/.restore/rofi/config.rasi_$NOW<b>

source: Title Background
nb: Bakgrunn for tittel

source: Title Text
nb: Titteltekst

source: Width (percentage of screen width)
nb: Bredde (i prosent av skjermbredden)

source: \n<b> Choose which theme to use as a starting point</b>\n
nb: \n<b>Velg et temasett å starte med</b>\n

source: \n<b>Select appearance settings and theme to use</b> (double-click for preview).
nb: \n<b>Velg innstillinger for utseende og temasett som skal brukes</b> (dobbeltklikk for forhåndsvisning).

source: \n<b>Select the rofi theme you wish to edit</b>\n\nThe .rasi file will be opened in your preferred text editor\n\n
nb: \n<b>Velg rofi-temasett for redigering</b>\n\n.rasi-fila vil åpnes i foretrukket tekstredigeringsprogram\n\n

source: \n<b>Select which tabs rofi should display</b>\n
nb: \n<b>Velg hvilke faner rofi skal vise</b>\n

source: \nThe theme to be edited has been saved in\n<b>$ROFIPATH</b> as\n\n<b>$EDITTHEMECOPY</b>\n\n
nb: \nTemasettet som skal redigeres er lagret i\n\n<b>$ROFIPATH</b> som\n\n<b>$EDITTHEMECOPY</b>\n\n

source: a powerful calculation engine
nb: en kraftig kalkulator

source: a set of links about using rofi
nb: en del lenker som omhandler bruk av rofi

source: displays all available executable files
nb: viser alle kjørbare filer

source: enables easy switching
nb: slår på rask bytting

source: fast access to files
nb: rask tilgang til filer

source: opens a secure shell
nb: åpner et sikkert skall

source: tab will not be shown\n\n
nb: fane vil ikke vises\n\n

source: the MX default that displays available apps
nb: MX-forvalget som viser tilgjengelige programmer
